// Generated by jextract

package au.ikx.glcore;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct shaderc_include_result {
 *     const char *source_name;
 *     size_t source_name_length;
 *     const char *content;
 *     size_t content_length;
 *     void *user_data;
 * }
 * }
 */
public class shaderc_include_result {

    shaderc_include_result() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ShaderC.C_POINTER.withName("source_name"),
        ShaderC.C_LONG.withName("source_name_length"),
        ShaderC.C_POINTER.withName("content"),
        ShaderC.C_LONG.withName("content_length"),
        ShaderC.C_POINTER.withName("user_data")
    ).withName("shaderc_include_result");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout source_name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("source_name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *source_name
     * }
     */
    public static final AddressLayout source_name$layout() {
        return source_name$LAYOUT;
    }

    private static final long source_name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *source_name
     * }
     */
    public static final long source_name$offset() {
        return source_name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *source_name
     * }
     */
    public static MemorySegment source_name(MemorySegment struct) {
        return struct.get(source_name$LAYOUT, source_name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *source_name
     * }
     */
    public static void source_name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(source_name$LAYOUT, source_name$OFFSET, fieldValue);
    }

    private static final OfLong source_name_length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("source_name_length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t source_name_length
     * }
     */
    public static final OfLong source_name_length$layout() {
        return source_name_length$LAYOUT;
    }

    private static final long source_name_length$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t source_name_length
     * }
     */
    public static final long source_name_length$offset() {
        return source_name_length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t source_name_length
     * }
     */
    public static long source_name_length(MemorySegment struct) {
        return struct.get(source_name_length$LAYOUT, source_name_length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t source_name_length
     * }
     */
    public static void source_name_length(MemorySegment struct, long fieldValue) {
        struct.set(source_name_length$LAYOUT, source_name_length$OFFSET, fieldValue);
    }

    private static final AddressLayout content$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("content"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *content
     * }
     */
    public static final AddressLayout content$layout() {
        return content$LAYOUT;
    }

    private static final long content$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *content
     * }
     */
    public static final long content$offset() {
        return content$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *content
     * }
     */
    public static MemorySegment content(MemorySegment struct) {
        return struct.get(content$LAYOUT, content$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *content
     * }
     */
    public static void content(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(content$LAYOUT, content$OFFSET, fieldValue);
    }

    private static final OfLong content_length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("content_length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t content_length
     * }
     */
    public static final OfLong content_length$layout() {
        return content_length$LAYOUT;
    }

    private static final long content_length$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t content_length
     * }
     */
    public static final long content_length$offset() {
        return content_length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t content_length
     * }
     */
    public static long content_length(MemorySegment struct) {
        return struct.get(content_length$LAYOUT, content_length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t content_length
     * }
     */
    public static void content_length(MemorySegment struct, long fieldValue) {
        struct.set(content_length$LAYOUT, content_length$OFFSET, fieldValue);
    }

    private static final AddressLayout user_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("user_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final AddressLayout user_data$layout() {
        return user_data$LAYOUT;
    }

    private static final long user_data$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final long user_data$offset() {
        return user_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static MemorySegment user_data(MemorySegment struct) {
        return struct.get(user_data$LAYOUT, user_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static void user_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(user_data$LAYOUT, user_data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

